Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиКотятВКоробках</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиКотят</xr:Item>
				<xr:Item>AccumulationRegister.СебестоимостьКотят</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коробка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Коробки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Породы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Продажа/Ext/ManagerModule.bsl
Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Продажа.Ссылка КАК Ссылка ИЗ Документ.Продажа КАК Продажа";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйДокумент = Документы.Продажа.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.19');
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Бобтейл");
	НоваяСтрока.Цена = 200;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = 200;
	
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("2");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Британец");
	НоваяСтрока.Цена = 300;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = 300;
		
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
